projects/03_naca_airfoil_analysis/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-5.0 -5.0 -0.05)  // 0
    (10.0 -5.0 -0.05)  // 1
    (10.0  5.0 -0.05)  // 2
    (-5.0  5.0 -0.05)  // 3
    (-5.0 -5.0  0.05)  // 4
    (10.0 -5.0  0.05)  // 5
    (10.0  5.0  0.05)  // 6
    (-5.0  5.0  0.05)  // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (240 160 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
    top
    {
        type symmetryPlane;
        faces
        (
            (3 2 6 7)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 7 6 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
