projects/03_naca_airfoil_analysis/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (50 0 0);

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    bottom
    {
        type            symmetryPlane;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (50 0 0);
    }
    top
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (50 0 0);
    }
    airfoil
    {
        type            noSlip;
    }
}

// ************************************************************************* //
