projects/03_naca_airfoil_analysis/0.orig/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 2.5e-05;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    bottom
    {
        type            symmetryPlane;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 2.5e-05;
        value           uniform 2.5e-05;
    }
    top
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 2.5e-05;
    }
    airfoil
    {
        type            fixedValue;
        value           uniform 0;
    }
}

// ************************************************************************* //
