projects/03_naca_airfoil_analysis/Allrun
#!/bin/bash
set -eu

cd "${0%/*}" || exit 1
touch airfoil.foam

ensure_openfoam() {
    if [ -n "${WM_PROJECT_DIR:-}" ]; then
        return
    fi

    for bashrc in \
        /opt/openfoam*/etc/bashrc \
        /usr/lib/openfoam*/etc/bashrc \
        /usr/lib/openfoam/*/etc/bashrc \
        /usr/local/openfoam*/etc/bashrc \
        "$HOME"/OpenFOAM/*/etc/bashrc
    do
        if [ -f "$bashrc" ]; then
            # shellcheck disable=SC1090
            . "$bashrc"
            break
        fi
    done

    : "${WM_PROJECT_DIR:?OpenFOAM not found. Source it first, then rerun ./Allrun.}"
}

ensure_openfoam
. "$WM_PROJECT_DIR"/bin/tools/RunFunctions

MESH_GEO=constant/airfoil_benchmark.geo
MESH_MSH=constant/airfoil_benchmark.msh

cp 0.orig/U 0/U
cp 0.orig/p 0/p
cp 0.orig/nuTilda 0/nuTilda
cp 0.orig/nut 0/nut
rm -f 0/Phi 0/phi

echo "========================================"
echo "  NACA 0012 Airfoil Analysis"
echo "========================================"

echo "Step 1: Generating benchmark-style NACA 0012 geometry..."
python3 mesh_generation_scripts/generate_naca0012_benchmark_geo.py \
    --output "$MESH_GEO" \
    --angle-deg -4 \
    --chord-points 101 \
    --domain-xmin -15 \
    --domain-xmax 20 \
    --domain-yhalf 15 \
    --mesh-size-airfoil 0.012 \
    --first-layer 0.004 \
    --bl-thickness 0.05 \
    --bl-ratio 1.12 \
    --near-size 0.03 \
    --near-dist 1.5 \
    --wake-size 0.04 \
    --wake-xmax 10 \
    --wake-yhalf 3 \
    --split-farfield

if [ ! -f "$MESH_MSH" ]; then
    if command -v gmsh >/dev/null 2>&1; then
        echo "Step 2: Meshing with Gmsh..."
        gmsh -3 -format msh2 "$MESH_GEO" -o "$MESH_MSH"
    else
        echo "Missing $MESH_MSH and gmsh is not available."
        echo "Generate the mesh on the host first, or use ./run_docker.sh."
        exit 1
    fi
else
    echo "Step 2: Reusing existing $MESH_MSH..."
fi

echo "Step 3: Importing Gmsh mesh into OpenFOAM..."
runApplication gmshToFoam "$MESH_MSH"

echo "Step 4: Setting patch types..."
runApplication changeDictionary

echo "Step 5: Renumbering mesh..."
runApplication renumberMesh -overwrite

echo "Step 6: Checking mesh quality..."
runApplication checkMesh

echo "Step 7: Running simpleFoam..."
runApplication simpleFoam

echo "========================================"
echo "  Simulation complete"
echo "  Check postProcessing/forceCoeffs/ for Cd/Cl"
echo "========================================"
